### 初级阶段：

1.命令是必须要学的，Linux常用的命令大概在80个左右，这些常用命令一定要熟练掌握。
2. 掌握Linux软件包的常用安装方法，例如源码安装，rpm方式安装等等。
3. 学习安装设备驱动程序（比如网卡、显卡驱动）
4. 熟悉Grub/Lilo引导程序及简单的修复操作。
5. 熟悉Linux文件系统和目录结构以及linux基本运行原理。
6. 掌握vi，gcc，gdb等常用编辑器，编译器，调试器。
7. 理解Shell别名、管道、I/O重定向、输入和输出以及shell简单脚本编程。
8. 学习Linux环境下的网络基本组建。

### 高级阶段:

1:尝试阅读Linux内核源码：
2:尝试编译安装和调试自己的Linux内核：
在阅读源码了解了Linux底层的运行原理后，完全可以编译一个适合自己的Linux系统来。
3:深入学习Shell， Perl，CGI等脚本语言：
这些脚本语言在Linux下非常强大，它们能完成你想做的任何事情，熟练掌握这些语言，可以让你在Linux系统下游刃有余，如鱼得水。
4:构建企业级Linux高可用集群系统：Linux下有很多开源免费的集群软件，利用这些免费的集群软件完全可以构建出与商业unix系统想媲美的集群系统来。
